package com.mvv.gui.words


// T O D O: 'optional' not correct name (what is correctly optional?). Need to rename it.
fun russianOptionalTrailingFinder(): SubSequenceFinder =
    SubSequenceFinder(russianOptionalEndingsTemplates, Direction.Backward, emptyList(), optionalRussianTrailingRules)

fun russianOptionalTrailingPronounsFinder(): SubSequenceFinder =
    SubSequenceFinder(russianOptionalEndingsPronounsTemplates, Direction.Backward, emptyList(), optionalRussianTrailingRules)


private val russianOptionalEndingsTemplates: Alt<Seq<String>> = sequenceOf(
    "{pp}",
    "{art}",
    "{prep}",
    "{prep} {pp}",
    "{prep} {art}",
    "{prep} {art} {pp}",
    "{prep} {pp} {art}",
).splitToWords()


// !!! without prepositions !!! prepositions should be kept !!!
private val russianOptionalEndingsPronounsTemplates: Alt<Seq<String>> = sequenceOf(
    "{pp}",
    "{art}",
).splitToWords()



private val russianArticlesAndSimilar: Alt<Seq<String>> = sequenceOf(

    "тому подобное", "т. п.", "т.п.", "тп",

    // T O D O: тобой,  мной bla-bla

    // articles
    //"the", "an", "a",
).splitToWords()



private const val russianStressChar: Char = 769.toChar()
internal fun String.removeStress(): String = this.filterNot { it == russianStressChar }


val russianPrepositions: List<Preposition> = sequenceOf(
    "а-ля",
    "без", "без ведома", "безо", "безъ",
    "благодаря",
    "близ", "близко от", "близь",
    "в",
    "в виде", "в виду",
    "в зависимости от",
    "в заключение",
    "в интересах",
    "в качестве",
    "в лице",
    "в отличие от",
    "в отношении",
    "в пандан",
    "в пользу",
    "в преддверии",
    "в продолжение",
    "в продолжении",
    "в результате",
    "в роли",
    "в связи с",
    "в силу",
    "в случае",
    "в соответствии с",
    "в течение",
    "в целях",
    "в честь",
    "вблизи",
    "ввиду",
    "вглубь",
    "вдогон",
    "вдоль",
    "вдоль по",
    "взамен",
    "включая",
    "вкруг",
    "вместо",
    "вне",
    "внизу",
    "внутри",
    "внутрь",
    "во",
    "во время",
    "во имя",
    "во славу",
    "вовнутрь",
    "возле",
    "вокруг",
    "вопреки",
    "вослед",
    "впереди",
    "вплоть до",
    "впредь до",
    "вразрез",
    "вроде",
    "вслед",
    "вслед за",
    "вследствие",
    "встречу",
    "выключая",
    "выше",
    "дли",
    "для",
    "для-ради",
    "до",
    "за",
    "за вычетом",
    "за исключением",
    "за счет",
    "за счёт",
    "за-ради",
    "замест",
    "заместо",
    "из",
    "из-за",
    "из-под",
    "из-подо",
    "изнутри",
    "изо",
    "исключая",
    "исходя из",
    "к",
    "к ко",
    "касаемо",
    "касательно",
    "ко",
    "кончая",
    "кроме",
    "кругом",
    "л",
    "лицом к лицу с",
    "меж",
    "между",
    "мимо",
    "на",
    "на благо",
    "на виду у",
    "на глазах у",
    "на предмет",
    "на протяжении",
    "наверху",
    "навроде",
    "навстречу",
    "над",
    "надо",
    "назад",
    "назади",
    "назло",
    "накануне",
    "наместо",
    "наперекор",
    "наперерез",
    "наперехват",
    "наподобие",
    "наподобье",
    "напротив",
    "наряду с",
    "насупротив",
    "насчет",
    "насчёт",
    "начиная с",
    "не без",
    "не говоря о",
    "не считая",
    "невзирая на",
    "недалеко от",
    "независимо от",
    "несмотря",
    "несмотря на",
    "ниже",
    "о",
    "об",
    "обо",
    "обок",
    "обочь",
    "около",
    "окрест",
    "окроме",
    "окромя",
    "округ",
    "опосля",
    "опричь",
    "от",
    "от имени",
    "от лица",
    "относительно",
    "ото",
    "пo",
    "перед",
    "передо",
    "по",
    "по линии",
    "по мере",
    "по направлению к",
    "по отношению к",
    "по поводу",
    "по причине",
    "по случаю",
    "по сравнению с",
    "по-за",
    "по-над",
    "по-под",
    "поблизости от",
    "повдоль",
    "поверх",
    "под",
    "под видом",
    "под эгидой",
    "подле",
    "подо",
    "подобно",
    "позади",
    "позадь",
    "позднее",
    "помимо",
    "поперек",
    "поперед",
    "поперёд",
    "поперек",
    "поперёк",
    "порядка",
    "посверху",
    "посереди",
    "посередине",
    "посередь",
    "посередке",
    "посерёдке",
    "после",
    "посреди",
    "посредине",
    "посредством",
    "пред",
    "предо",
    "преж",
    "прежде",
    "при",
    "при помощи",
    "применительно к",
    "про",
    "промеж",
    "промежду",
    "против",
    "противно",
    "противу",
    "путем",
    "путём",
    "ради",
    "рядом с",
    "с",
    "с ведома",
    "с-под",
    "сквозь",
    "со",
    "согласно",
    "спустя",
    "среди",
    "у",
    "через",
    "чрез",
    )
    .map { it.lowercase() }
    .filter { it.isNotEmpty() }
    .distinct()
    .map { Preposition(it) }
    .sortedBy { -it.size }
    .toList()


/*
  Система падежей русского языка
    Именительный падеж (Nominative case)
      слово в именительном падеже отвечает на вопрос кто? что?: человек, стена;
    Родительный падеж (Genitive case)
      слово в родительном падеже отвечает на вопрос кого? чего?: человека, стены;
    Дательный падеж (Dative case)
      слово в дательном падеже отвечает на вопрос кому? чему?: человеку, стене;
    Винительный падеж (Accusative case)
      слово в винительном падеже отвечает на вопрос кого? что?: [видеть] человека, стену;
      Вижу (кого? что?) банку, зуб.
      обнял маму — обнял (кого?) маму (В. п.);
    Творительный падеж (Instrumental case)
      слово в творительном падеже отвечает на вопрос кем? чем?: человеком, стеной;
      Горжусь (кем? чем?) банкой, зубом.
    Предложный падеж (Prepositional case)
      слово в предложном падеже отвечает на вопрос о ком? о чем?: о человеке, о стене.

  https://skysmart.ru/articles/russian/padezhi
  https://reallanguage.club/grammatika-russkogo-yazyka/grammaticheskie-i-sintaksicheskie-kategorii/padezhi-russkogo-yazyka/
 */

private val russianPronouns: Alt<Seq<String>> = sequenceOf(

    "что-либо", "чего-либо", "чему-либо", "чем-либо", "чём-либо", "ч-л", "ч-л.",
    "что-л", "чего-л", "чему-л", "чем-л", "чём-л", "ч-л",
    "кто-либо", "кого-либо", "кому-либо", "кем-либо", "ком-либо", "к-л", "к-л.",
    "кто-л", "кого-л", "кому-л", "кем-л", "ком-л", "к-л",
    "какой-л", "какого-л", "каком-л", "какому-л", "каким-л", "к-л",

    // See https://ru.wikipedia.org/wiki/%D0%9C%D0%B5%D1%81%D1%82%D0%BE%D0%B8%D0%BC%D0%B5%D0%BD%D0%B8%D0%B5
    //
    "я", "меня/себя", "мне", "меня", "мной", "мною", "мне", "обо мне",
    "ты", "тебя", "тебе", "тебя", "тобой/тобою", "тебе", "о тебе",

    "мы", "нас", "нам", "нами", "о нас", "нас",
    "вы", "вас", "вам", "вас", "вами", "о вас", "вас",

    "он", "его/него", "ему/нему", "его", "им/ним", "нём", "нем", "о нём", "о нем",
    "она", "её/ее/неё/нее", "ей/ней", "её/ее", "ей/ею/ней/нею", "о ней", "ней",
    "оно", "его/него", "ему/нему", "его",
    "они", "их", "им/ним", "их", "ими", "о них", "них",

    "кто", "кого", "кому", "кого", "кем", "ком", "о ком",
    "кто-то", "кого-то", "кому-то", "кого-то", "кем-то", "ком-то", "о ком-то",
    "кто-нибудь", "кого-нибудь", "кому-нибудь", "кого-нибудь", "кем-нибудь", "ком-нибудь", "о ком-нибудь",
    "кто-либо", "кого-либо", "кому-либо", "кого-либо", "кем-либо", "ком-либо", "о ком-либо",
    "кое-кто", "кое-кого", "кое-кому", "кое-кого", "кое-кем", "кое-ком", "о кое-ком",
    "некто", "некого", "некому", "некого", "некем", "неком", "о неком",

    "что", "чего", "чему", "что", "чем", "о чем", "о чём", "чём",
    "что-то", "чего-то", "чему-то", "что-то", "чем-то", "о чем-то", "о чём-то", "чём-то",
    "что-нибудь", "чего-нибудь", "чему-нибудь", "что-нибудь", "чем-нибудь", "о чем-нибудь", "о чём-нибудь", "чём-нибудь",
    "что-либо", "чего-либо", "чему-либо", "что-либо", "чем-либо", "о чем-либо", "о чём-либо", "чём-либо",
    "кое-что", "кое-чего", "кое-чему", "кое-что", "кое-чем", "о кое-чем", "о кое-чём", "кое-чём",
    "нечто", "нечего", "нечему", "нечто", "нечем", "о нечем", "о нечём", "нечём",

    "столько", "стольких", "стольким", "столько", "столькими", "о стольких", "стольких",

    "этот", "этого", "этому", "этот/этого", "этим", "об этом", "о этом", "этом",
    "эта", "этой", "эту", "эту", "этой", "об этой", "о этой", "этой",
    "это", "этого", "этому", "это", "этим", "об этом", "о этом", "этом",
    "эти", "этих", "этим", "этих", "этими", "об этих", "о этих", "этих",

    "тот", "того", "тому", "того", "тем", "о том", "том",
    "та", "той", "той", "ту", "той", "о той", "той",
    "то", "того", "тому", "то", "тем", "о том", "том",
    "те", "тех", "тем", "тех", "теми", "о тех", "тех",

    "такой/таков", "такого", "такому", "такого", "таким", "о таком", "таком",
    "такая", "такой", "такой", "такую", "такой", "о такой", "такой",
    "такое", "такого", "такому", "такое", "таким", "о таком", "таком",
    "такие", "таких", "таким", "таких", "такими", "о таких", "таких",

    "таков", "такового", "таковому", "такового", "таковым", "о таковом", "таковом",
    "такова", "таковой", "таковой", "таковую", "таковой", "о таковой", "таковой",
    "таково", "такового", "таковому", "таково", "таковым", "о таковом", "таковом",
    "таковы", "таковых", "таковым", "таковы", "таковым/таковыми", "о таковых", "таковых",

    "сей", "сия", "сие", // нет падежей
    "сии", "сиими", "сиим", "сиих", "сиими", "о сиих", "сиих",

    "все", "всех", "всем", "всех", "всеми", "о всех", "всех",
    "всё/все", "всего", "всему", "всё/все", "всем", "о всём", "о всем", "всём", "всем",
    "весь", "всего", "всему", "весь/всего", "всем", "о всем", "всем", "о всём", "всём",
    "всяк/всякий", "всякого", "всякому", "всякого", "всяким", "о всяком", "всяком",
    "любой", "любого", "любому", "любого", "любым", "о любом", "любом",
    "каждый", "каждого", "каждому", "каждого", "каждым", "о каждом", "каждом",
    "сам/самый", "самого", "самому", "самого", "самим", "о самом", "самом",
    "другой", "другого", "другому", "другого", "другой", "другой", "другой", "другой",
    "иной", "иного", "иному", "иного", "иным", "о ином", "ином",

    "никто", "никого", "никому", "никого", "никем", "ником", "о ником",
    "ничто", "ничего", "ничему", "ничто", "ничем", "о ничем", "о ничём", "ничём",
    "нисколько", "нискольких", "нискольким", "нисколько", "нисколькими", "о нискольких", "нискольких",
    "ничей", "ничьего́", "ничьему́", "ничьего́/ничей", "ничьи́м", "ничьём", "о ничьём",
    "не́кто", "не́кого", "не́кому", "не́кого", "не́кем", "не́ком", "о не́ком",
    "не́что", "не́чего", "не́чему", "не́что", "не́чем", "о не́чем", "о не́чём", "не́чём", "о не́чем", "не́чем",
    "некий", "некого", "некому", "некого", "неким", "о неком", "неком",
    "некие", "неких", "неким", "неких", "некими", "о неких", "неких",
    "не́сколько", "не́скольких", "не́скольким", "не́сколько", "не́сколькими", "о не́скольких", "не́скольких",

    // неопределённые местоимения с приставкой кое- или постфиксами -то, -либо, -нибудь
    // See https://goldrussian.ru/neopredelennye-mestoimenija.html
    //     https://is.muni.cz/do/rect/el/estud/pedf/js18/morfologie_rustina/web/ru/ch11_s03.html
    //     https://izamorfix.ru/rus/morfologiya/neopredelennye_mestoim.html
    //     https://reallanguage.club/grammatika-russkogo-yazyka/chasti-rechi-v-russkom-yazyke/mestoimeniya-v-russkom-yazyke/
    "какой/каков", "какого", "какому", "какого", "каким", "о каком", "каком",
    "кое-какой", "кое-какого", "кое-какому", "кое-какого", "кое-каким", "о кое-каком", "кое-каком",
    "какой-то", "какого-то", "какому-то", "какого-то", "каким-то", "о каком-то", "каком-то",
    "какой-либо", "какого-либо", "какому-либо", "какого-либо", "каким-либо", "о каком-либо", "каком-либо",
    "какой-нибудь", "какого-нибудь", "какому-нибудь", "какого-нибудь", "каким-нибудь", "о каком-нибудь", "каком-нибудь",
    "никакой", "никакого", "никакому", "никакого", "никаким", "о никаком", "никаком",

    "какая/какова", "какой", "какой", "какую", "какой", "о какую", "какую",
    "какая-то", "какой-то", "какой-то", "какую-то", "какой-то", "о какую-то", "какую-то",
    "какая-либо", "какой-либо", "какой-либо", "какую-либо", "какой-либо", "о какую-либо", "какую-либо",
    "какая-нибудь", "какой-нибудь", "какой-нибудь", "какую-нибудь", "какой-нибудь", "о какую-нибудь", "какую-нибудь",
    "никакая", "никакой", "никакой", "никакую", "никакой", "нио какую", "никакую",
    "кое-какая", "кое-какой", "кое-какой", "кое-какую", "кое-какой", "кое-о какую", "кое-какую",

    "какое/каково", "кое-какое", "какое-то", "какое-либо", "какое-нибудь", "никакое", // the same as for "какой/каков"

    "какие/каковы", "каких", "каким", "каких", "какими", "о каких", "каких",
    "какие-то", "каких-то", "каким-то", "каких-то", "какими-то", "о каких-то", "каких-то",
    "какие-либо", "каких-либо", "каким-либо", "каких-либо", "какими-либо", "о каких-либо", "каких-либо",
    "какие-нибудь", "каких-нибудь", "каким-нибудь", "каких-нибудь", "какими-нибудь", "о каких-нибудь", "каких-нибудь",
    "никакие", "никаких", "никаким", "никаких", "никакими", "о никаких", "никаких",
    "кое-какие", "кое-каких", "кое-каким", "кое-каких", "кое-какими", "о кое-каких", "кое-каких",

    "некий", "некоего", "некоему", "некоего", "неким", "о некоем", "некоем",
    "некая", "некой", "некой", "некую", "некой/некою", "о некой", "некой",
    "некое", "некоего", "некоему", "некое", "неким", "о некоем", "некоем",
    "некие", "неких", "неким", "неких/некие", "некими", "о неких", "неких",

    "некоторый", "некоторого", "некоторому", "некоторого/некоторый", "некоторым", "о некотором",
    "некоторая", "некоторой", "некоторой", "некоторую", "некоторой", "о некоторой", "некоторой",
    "некоторое", "чье-то",
    "некоторые", "некоторых", "некоторым", "некоторых/некоторые", "некоторыми", "о некоторых",

    "чей-то", "чьего-то", "чьему-то", "чьего-то/чей-то", "чьим-то", "о чьем-то", "чьем-то",
    "чья-то", "чьей-то", "чьей-то", "чью-то", "чьей-то", "о чьей-то", "чьей-то",
    "чьи-то", "чьих-то", "чьим-то", "чьих-то/чьи-то", "чьими-то", "о чьих-то",

    // See https://russkiiyazyk.ru/chasti-rechi/mestoimenie/neopredelennye-mestoimeniia.html
    "чей", "чьего́", "чьему́", "чьего́/чей", "чьи́м", "чьём", "о чьём",
    "кое-чей", "кое-чьего́", "кое-чьему́", "кое-чьего́/кое-чей", "кое-чьи́м", "о кое-чьём", "кое-чьём",
    "чей-то", "чьего́-то", "чьему́-то", "чьего́-то/чей-то", "чьи́м-то", "чьём-то", "о чьём-то",
    "чей-либо", "чьего́-либо", "чьему́-либо", "чьего́-либо/чей-либо", "чьи́м-либо", "чьём-либо", "о чьём-либо",
    "чей-нибудь", "чьего́-нибудь", "чьему́-нибудь", "чьего́-нибудь/чей-нибудь", "чьи́м-нибудь", "чьём-нибудь", "о чьём-нибудь",

    "чьё/чье", "чьего́", "чьему́", "чьё", "чьи́м", "чьём/чьем",
    "чья́", "чье́й", "чье́й", "чью́", "чье́й/чье́ю", "чье́й",
    "чьи́", "чьи́х", "чьи́м", "чьи́х/чьи́", "чьи́ми", "чьи́х",

    "который", "которого", "которому", "которого", "которым", "о котором", "котором",
    "некоторый", "некоторого", "некоторому", "некоторого", "некоторым", "о некотором", "некотором",
    "который-либо", "которого-либо", "которому-либо", "которого-либо", "которым-либо", "о котором-либо", "котором-либо",
    "который-нибудь", "которого-нибудь", "которому-нибудь", "которого-нибудь", "которым-нибудь", "о котором-нибудь", "котором-нибудь",

    //-------------------------------------------------------------------------------
    // probably it not pronounce (and should be moved to other)

    "сколько", "скольких", "скольким", "сколько", "сколькими", "скольких",
    "несколько", "нескольких", "нескольким", "несколько", "несколькими", "нескольких",
    "сколько-то", "скольких-то", "скольким-то", "сколько-то", "сколькими-то", "скольких-то",
    "сколько-нибудь", "скольких-нибудь", "скольким-нибудь", "сколько-нибудь", "сколькими-нибудь", "скольких-нибудь",
    "сколько-либо", "скольких-либо", "скольким-либо", "сколько-либо", "сколькими-либо", "скольких-либо",

    "где-то",
    "где-либо",
    "где-нибудь",

    "куда-то",
    "куда-либо",
    "куда-нибудь",

    "когда-то",
    "когда-либо",
    "когда-нибудь",

    "как-то",
    "как-либо",
    "как-нибудь",

    "почему-то",
    "почему-либо",
    "почему-нибудь",

    "зачем-то",
    "зачем-либо",
    "зачем-нибудь",
    )
    .flatMap { it.removeStress().split('/', ',') }
    .splitToWords()


private val optionalRussianTrailingRules = SubSequenceLanguageRules(
    russianArticlesAndSimilar,
    russianPrepositions,
    emptyList(),
    russianPronouns,
)


val russianOptionalTrailingPronounsFinder: SubSequenceFinder = russianOptionalTrailingPronounsFinder()
